reading.tex
% Created 2019-09-08 Sun 17:30
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Ben Sless}
\date{\today}
\title{Reading}
\hypersetup{
 pdfauthor={Ben Sless},
 pdftitle={Reading},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.0.50 (Org mode 9.2.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Introductions}
\label{sec:org3a83f47}

\begin{itemize}
\item \href{https://www.youtube.com/watch?v=P76Vbsk\_3J0}{Clojure for Java Programmers Part 1 - Rich Hickey}
\item \href{https://www.youtube.com/watch?v=wASCH\_gPnDw}{Expert to Expert: Rich Hickey and Brian Beckman - Inside Clojure}
\end{itemize}

\section{Clojure}
\label{sec:orgb2dc844}

\begin{itemize}
\item \href{https://github.com/bbatsov/clojure-style-guide}{Clojure Style Guide}
\item \href{https://www.infoq.com/presentations/Simple-Made-Easy/}{Simple Made Easy}
\item \href{https://www.youtube.com/watch?v=-6BsiVyC1kM}{The Value of Values with Rich Hickey}
\item \href{https://www.youtube.com/watch?v=VSdnJDO-xdg}{Clojure Made Simple}
\end{itemize}

\subsection{Books}
\label{sec:org97ce661}

\begin{itemize}
\item \href{https://www.braveclojure.com/}{Clojure For The Brave And True}
\item \href{https://leanpub.com/elementsofclojure}{Elements Of Clojure - Zach Tellman}
\end{itemize}

\section{System Design}
\label{sec:orgdfd5b22}

\begin{itemize}
\item \href{https://www.youtube.com/watch?v=ROor6\_NGIWU}{The Language of the System - Rich Hickey}
\end{itemize}

\subsection{Component}
\label{sec:org72f8f4d}

\begin{itemize}
\item \href{https://www.youtube.com/watch?v=13cmHf\_kt-Q}{Stuart Sierra - Components Just Enough Structure}
\item \href{https://www.youtube.com/watch?v=av9Xi6CNqq4}{Anthony Marcar - Clojure At Scale @WalmartLabs}
\end{itemize}

\section{Concurrency}
\label{sec:org389d61a}

\begin{itemize}
\item \href{https://www.youtube.com/watch?v=dGVqrGmwOAw}{Clojure Concurrency - Rich Hickey}
\item \href{https://www.infoq.com/presentations/clojure-core-async/}{Clojure core.async}
\item \href{https://purelyfunctional.tv/guide/clojure-concurrency/}{Clojure Concurrency - Purely Functional}
\end{itemize}

\section{Types, Schema and Spec}
\label{sec:orgbfb9819}

\begin{itemize}
\item \href{https://www.youtube.com/watch?v=YR5WdGrpoug}{Maybe Not - Rich Hickey}
\end{itemize}

\section{Functional Programming}
\label{sec:org2d8de8d}

\begin{itemize}
\item \href{http://mishadoff.com/blog/clojure-design-patterns/}{Clojure Design Patterns}
\item \href{https://www.youtube.com/watch?v=srQt1NAHYC0}{Functional Design Patterns - Scott Wlaschin}
\item \href{https://www.youtube.com/watch?v=Nrp\_LZ-XGsY}{The Functional Programmer's Toolkit - Scott Wlaschin}
\end{itemize}

\section{Lisp}
\label{sec:org8de4b48}

\begin{itemize}
\item \href{http://www.paulgraham.com/avg.html}{Beating The Averages - Paul Graham}
\end{itemize}

\section{Testing}
\label{sec:org3eec661}

\begin{itemize}
\item \href{https://www.youtube.com/watch?v=tWn8RA\_DEic}{Structure and Interpretation of Test Cases - Kevlin Henney}
\end{itemize}

\section{Practices}
\label{sec:org3de6b8b}

\begin{itemize}
\item \href{https://www.youtube.com/watch?v=ZsHMHukIlJY}{ITT 2016 - Kevlin Henney - Seven Ineffective Coding Habits of Many Programmers}
\end{itemize}

\section{Philosophy}
\label{sec:org734563c}

\begin{itemize}
\item \href{https://www.infoq.com/presentations/Simple-Made-Easy/}{Simple Made Easy - Rich Hickey}
\item \href{https://www.youtube.com/watch?v=-6BsiVyC1kM}{The Value of Values with Rich Hickey}
\item \href{https://www.youtube.com/watch?v=YR5WdGrpoug}{Maybe Not - Rich Hickey}
\item \href{https://www.youtube.com/watch?v=2V1FtfBDsLU}{Effective Programs - 10 Years of Clojure - Rich Hickey}
\item \href{https://www.youtube.com/watch?v=B3b4tremI5o}{GOTO 2016 • Small Is Beautiful • Kevlin Henney}
\item \href{https://www.youtube.com/watch?v=AbgsfeGvg3E}{GOTO 2018 • Old Is the New New • Kevlin Henney}
\item \href{https://www.youtube.com/watch?v=5cafjDPPtJ0}{Software Art Thou: Kevlin Henney - What Do You Mean}
\item \href{https://www.youtube.com/watch?v=xjf3eW5lftw}{Agility != Speed - Kevlin Henney}
\item \href{https://www.youtube.com/watch?v=0fpDlAEQio4}{Four Languages from Forty Years Ago - Scott Wlaschin}
\item \href{https://www.youtube.com/watch?v=OyfBQmvr2Hc}{William Byrd on "The Most Beautiful Program Ever Written"}
\item \href{https://www.youtube.com/watch?v=SrKj4hYic5A}{Programming Should Eat Itself - Nada Amin}
\end{itemize}

\section{Structure And Interpretation Of Computer Programs}
\label{sec:org92e95a7}

\subsection{MIT Video Lectures}
\label{sec:orgec64404}

\begin{itemize}
\item \href{https://www.youtube.com/watch?list=PLE18841CABEA24090\&v=-J\_xL4IGhJA}{Lecture 1A: Overview and Introduction to Lisp}
\end{itemize}

\subsection{Course Website}
\label{sec:org0220d06}

\begin{itemize}
\item \href{https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-001-structure-and-interpretation-of-computer-programs-spring-2005/}{Structure and Interpretation of Computer Programs}
\end{itemize}

\subsection{Book Remasters}
\label{sec:orgcb10a07}

\begin{itemize}
\item \href{https://github.com/sarabander/sicp-pdf/raw/master/sicp.pdf}{pdf version}
\item \href{https://github.com/sarabander/sicp-epub/blob/master/sicp.epub?raw=true}{epub version}
\item \href{https://sarabander.github.io/sicp/}{html version}
\end{itemize}

\section{Academic Work}
\label{sec:org0959a99}

\subsection{Armstrong Thesis (2003)}
\label{sec:orgec82abf}

\href{http://erlang.org/download/armstrong\_thesis\_2003.pdf}{Armstrong Thesis}

Making reliable distributed systems in the presence of sodware errors

\subsection{CSP Hoare 1978}
\label{sec:orgc905643}

\href{https://spinroot.com/courses/summer/Papers/hoare\_1978.pdf}{Communicating Sequential Processes}

\subsection{Recursive Functions Of Symbolic Expressions (McCarthy 1960)}
\label{sec:orgd1eac9e}

\href{http://www-formal.stanford.edu/jmc/recursive.pdf}{Recursive Functions of Symbolic Expressions and Their Computation by Machine, Part I}
\end{document}
